# 4 Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data

### Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame

In [3]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols)
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df = df.reset_index()

df['teks'] = list('ABCDE')

df

D:\ANACONDA\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00         13.0         19    A
1 2000-01-01 01:00:00          5.0          1    B
2 2000-01-01 02:00:00          9.0          6    C
3 2000-01-01 03:00:00         10.0         18    D
4 2000-01-01 04:00:00          8.0         14    E

In [ ]:
# langkah-langkah :
# Membangun data frame dasar (kolom dan baris)
# colomn diberi nama
# object data frame dengan memanggil fungsi
# dikonversi ke tipe data sesuai dengan data yang ada (.astype)
# membuat index
# menambah 1 kolom lagi

In [ ]:
# warning : function yang tidak lagi support di versi-versi selanjutnya

In [4]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

### Memilih kolom bertipe data numerik

In [5]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         13.0         19
1          5.0          1
2          9.0          6
3         10.0         18
4          8.0         14

In [6]:
df.select_dtypes(include='float')

   bil_pecahan
0         13.0
1          5.0
2          9.0
3         10.0
4          8.0

In [7]:
df.select_dtypes(include='int')

   bil_bulat
0         19
1          1
2          6
3         18
4         14

### Memilih kolom bertipe data string atau object

In [8]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

### Memilih kolom bertipe data datetime

In [9]:
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

### Memilih kolom dengan kombinasi tipe data

In [10]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         13.0         19    A
1          5.0          1    B
2          9.0          6    C
3         10.0         18    D
4          8.0         14    E